---
kind: property
id: P:Autodesk.Revit.DB.CurveByPointsArray.Size
source: html/d7291317-08b9-2ce5-2cfc-b89002d1819e.htm
---
# Autodesk.Revit.DB.CurveByPointsArray.Size Property

Returns the number of curves that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```